import cv2

################################################################
# #基本開啟圖片功能
# img=cv2.imread('LOGO1.jpg')#讀取圖片

# img =cv2.resize(img,(300,300))#改變圖片尺寸(圖片函數,尺寸(長,寬),fx=長的倍數,fy=寬的倍數)

# cv2.imshow('LOGO1',img)#顯示視窗('顯示名稱','圖片的函數')

# cv2.waitKey(0)#等待關閉

################################################################
#開啟影片功能
cap = cv2.VideoCapture('1695185833048.mp4')#讀取對應的原始動畫


################################################################
#取得動畫第一偵停留的動畫
# ret, frame =cap.read()#讀取下一動畫的第一偵
# if ret:
#     cv2.imshow('video',frame)#顧示圖片

########################################################################
#寫出循環，播放全部的動畫
while True:
    ret, frame =cap.read()#讀取下一動畫的第一停留
    if ret:
        cv2.imshow('video',frame)#顧示動畫
    else:
        break
    if cv2.waitKey(1) & 0xFF == ord('q'):#按下q關閉
        break

cv2.waitKey(0)